#### ExportLayerKey Members

---

|  |
| --- |
| ExportLayerKey Class   Constructors   Methods   Properties   See Also |

The  ExportLayerKey  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | ExportLayerKey | Constructs a new ExportLayerKey with default values. |
| Public method | ExportLayerKey(String, String, SpecialType) | Constructs a new ExportLayerKey with categoryName, subCategoryName and a special type. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  ExportLayerKey |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | CategoryName | The category name. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Public property | SpecialType | The special type for layer key. |
| Public property | SubCategoryName | The subcategrory Name. |

# See Also

ExportLayerKey Class

Autodesk.Revit.DB Namespace